# =============================================================================
# ԹԵՄԱ: ՄԱՏՐԻՑՆԵՐ (2D LISTS), ԻՆԴԵՔՍԱՎՈՐՈՒՄ ԵՎ ԹԱԿԱՐԴՆԵՐ
# =============================================================================

# ԱՌԱՋԱԴՐԱՆՔ:
# 1. List Comprehension-ով ստեղծիր 4x4 չափի մատրից (matrix), որտեղ բոլոր թվերը սկզբում 0 են:
#    (Ուշադրություն. Չօգտագործել [[0]*4]*4 թակարդը!)
#
# 2. Գլխավոր անկյունագծի (Main Diagonal) տարրերը դարձրու 1:
#    Այսինքն՝ matrix[0][0], matrix[1][1], matrix[2][2], matrix[3][3] պետք է դառնան 1:
#    (Հուշում. կարող ես անել մեկ պարզ for ցիկլով):
#
# 3. Տպիր ստացված մատրիցը գեղեցիկ՝ ամեն տողը առանձին:
#    Ակնկալվող տեսքը՝
#    [1, 0, 0, 0]
#    [0, 1, 0, 0]
#    [0, 0, 1, 0]
#    [0, 0, 0, 1]

# Գրիր քո կոդը այստեղ՝

m=[[0]*4 for i in range(4)]
for i in range(4):
    m[i][i]=1
for i in range(4):
    print(m[i])
for i in range(4):
    k=3-i
    m[i][k]=2
print()
for i in range(4):
    print(m[i])
