# =============================================================================
# ԽՆԴԻՐ: ԶՐՈՆԵՐԻ ՏԵՂԱՓՈԽՈՒՄ ՎԵՐՋ (MOVE ZEROES — LEETCODE #283)
# =============================================================================
#
# ՊԱՀԱՆՋԸ.
# Տրված է թվերի ցուցակ (nums):
# Տեղափոխել բոլոր 0-ները ցուցակի վերջ՝ պահպանելով ոչ զրոյական թվերի
# սկզբնական հերթականությունը:
#
# ԽԻՍՏ ԿԱՆՈՆ:
# Փոփոխությունը պետք է կատարել ՀԵՆՑ ՆՈՒՅՆ ՑՈՒՑԱԿԻ ՄԵՋ (In-Place):
# Արգելվում է ստեղծել նոր ցուցակ (օրինակ՝ res = []):
#
# ՕՐԻՆԱԿՆԵՐ.
# 1. nums = [0, 1, 0, 3, 12]  -> [1, 3, 12, 0, 0]
# 2. nums = [0, 0, 1]         -> [1, 0, 0]
# 3. nums = [1, 2, 3]         -> [1, 2, 3]
# =============================================================================

def move_zeroes(nums):
    # Գրիր քո կոդը այստեղ
    count=nums.count(0)
    for i in range(count):
        print(count)

        nums.remove(0)
        nums.append(0)
    return nums

    
def move_zeroes_linear(nums):
    pos=0
    for i in nums:
        if i!=0:
            nums[pos]=i
            pos+=1
    while pos<len(nums):
        nums[pos]=0
        pos+=1




# Թեստ 1
nums1 = [0, 1, 0, 3, 12]
move_zeroes(nums1)
print("Թեստ 1:", nums1)  # Սպասվող արդյունք՝ [1, 3, 12, 0, 0]

# Թեստ 2
nums2 = [8,5, 1]
move_zeroes(nums2)
print("Թեստ 1:", nums2)