# =============================================================================
# ԽՆԴԻՐ 5: Ուժեղ Թվեր (Strong / Krishnamurthy Numbers)
# Ամսաթիվ: 30/09/2026 (Session 2)
# Բարդություն: Միջին (Medium)
#
# ՊԱՀԱՆՋԸ:
# Գտնել և տպել [1, 100000] միջակայքում գտնվող բոլոր Strong թվերը:
#
# Թիվը կոչվում է Strong (Ուժեղ), եթե նրա թվանշանների ֆակտորիալների
# գումարը հավասար է հենց այդ թվին:
#
# Հիշեցում՝
#   n! (n ֆակտորիալ) = 1 * 2 * 3 * ... * n
#   Հատուկ դեպք՝ 0! = 1
#
# Օրինակներ:
#   1     -> 1! = 1 (Strong է)
#   2     -> 2! = 2 (Strong է)
#   145   -> 1! + 4! + 5! = 1 + 24 + 120 = 145 (Strong է)
#   40585 -> 4! + 0! + 5! + 8! + 5! = 24 + 1 + 120 + 40320 + 120 = 40585 (Strong է)
#
# ԿԱՆՈՆՆԵՐ:
# 1. Չօգտագործել str()
# 2. Չօգտագործել math.factorial() (ֆակտորիալը հաշվել ինքնուրույն՝ ցիկլով)
# =============================================================================

# Գրի՛ր քո կոդը այստեղ.

def factorial(n):
    if n==0 or n==1:
        return 1
    else:
        return factorial(n-1)*n
for number in range(1,100000):
    new_number=number
    sum_number=0
    while new_number>0:
        m=new_number%10
        new_number=new_number//10
        
        sum_number=sum_number+factorial(m)

    if sum_number==number:
        print("Strong է",number)